Repository: Dekhnar/flutter-tic-tac-toe
Catalog: lib/l10n/intl_*.arb
Languages: fr

source: Retry
fr: Réessayer

# errorLoading
source: Loading error
fr: Erreur de chargement

source: Online 1v1
fr: 1v1 en ligne

source: Offline 1v1
fr: 1v1 hors ligne

source: Local 1v1
fr: 1v1 local

source: Play against AI.
fr: Affronte l’IA.

# playFriendOnline
source: Play your friend online.
fr: Affronte ton ami en ligne.

# notYourTurn
source: It's not your turn.
fr: Ce n'est pas ton tour.

# cellAlreadyTaken
source: This cell is already taken.
fr: Cette case est déjà prise.

source: Paste
fr: Coller

source: Start
fr: Commencer

source: Versus AI (offline)
fr: Contre l’IA (hors ligne)

source: Copy
fr: Copier

source: Create
fr: Créer

source: Create game
fr: Créer la partie

# waitingForOpponent
source: Waiting for an opponentâ€¦
fr: En attente d'un adversaire…

source: Invalid cell index.
fr: Index de case invalide.

source: Play
fr: Jouer

# playOnSameDevice
source: Play on the same device.
fr: Jouez à deux sur le même appareil.

# roundIsOver
source: The round is over.
fr: La manche est terminée.

# gameNotStartedYet
source: The game has not started yet.
fr: La partie n'a pas encore commencé.

# startGame
source: Start the game
fr: Lancer la partie

source: Link copied
fr: Lien copié

source: Share link to paste
fr: Lien de partage à coller

# shareLinkToShare
source: Shareable link
fr: Lien de partage à partager

source: Online game
fr: Partie en ligne

source: Game not found.
fr: Partie introuvable.

# emptyClipboard
source: Clipboard is empty
fr: Presse-papiers vide

source: Player first name
fr: Prénom du Joueur

# playerOneFirstName
source: Player 1 first name
fr: Prénom du Joueur 1

# playerTwoFirstName
source: Player 2 first name
fr: Prénom du Joueur 2

source: Join
fr: Rejoindre

source: Play again
fr: Rejouer

source: Solo vs AI
fr: Solo vs IA

# opponentMustJoin
source: An opponent must join the game.
fr: Un adversaire doit rejoindre la partie.

# pleaseProvideLink
source: Please provide a link
fr: Veuillez fournir un lien

# pleaseEnterFirstName
source: Please enter a first name
fr: Veuillez saisir un prénom

source: Player O wins
fr: Victoire Joueur O

source: Player X wins
fr: Victoire Joueur X

source: Draw
fr: Égalité

# emptySnapshotAfterCreate
source: Empty snapshot after create (no data returned).
fr: Données de création introuvables (aucune donnée retournée).

source: Please retry
fr: Veuillez réessayer

# errorTitle
source: Error
fr: Erreur

# errorRetryLater
source: An error occurred, please try again later.
fr: Une erreur est survenue, veuillez réessayer plus tard.

# quit
source: Close
fr: Quitter

# boardCellEmpty
source: Cell {row} {column} empty
fr: Case {row} {column} vide

# boardCellCross
source: Cell {row} {column} cross
fr: Case {row} {column} croix

# boardCellCircle
source: Cell {row} {column} circle
fr: Case {row} {column} rond
